FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1765.h
// Copyright (c) 2009 Rowley Associates Limited.
//
// This file may be distributed under the terms of the License Agreement
// provided with this software.
//
// THIS FILE IS PROVIDED AS IS WITH NO WARRANTY OF ANY KIND, INCLUDING THE
// WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.

#ifndef LPC1765_h
#define LPC1765_h

#define GPIO_BASE_ADDRESS 0x2009C000

#define FIO0DIR (*(volatile unsigned long *)0x2009C000)
#define FIO0DIR_OFFSET 0x0

#define FIO0DIR0 (*(volatile unsigned char *)0x2009C000)
#define FIO0DIR0_OFFSET 0x0

#define FIO0DIR1 (*(volatile unsigned char *)0x2009C001)
#define FIO0DIR1_OFFSET 0x1

#define FIO0DIR2 (*(volatile unsigned char *)0x2009C002)
#define FIO0DIR2_OFFSET 0x2

#define FIO0DIR3 (*(volatile unsigned char *)0x2009C003)
#define FIO0DIR3_OFFSET 0x3

#define FIO0DIRL (*(volatile unsigned short *)0x2009C000)
#define FIO0DIRL_OFFSET 0x0

#define FIO0DIRU (*(volatile unsigned short *)0x2009C002)
#define FIO0DIRH FIO0DIRU
#define FIO0DIRU_OFFSET 0x2
#define FIO0DIRH_OFFSET FIO0DIRU_OFFSET

#define FIO1DIR (*(volatile unsigned long *)0x2009C020)
#define FIO1DIR_OFFSET 0x20

#define FIO1DIR0 (*(volatile unsigned char *)0x2009C020)
#define FIO1DIR0_OFFSET 0x20

#define FIO1DIR1 (*(volatile unsigned char *)0x2009C021)
#define FIO1DIR1_OFFSET 0x21

#define FIO1DIR2 (*(volatile unsigned char *)0x2009C022)
#define FIO1DIR2_OFFSET 0x22

#define FIO1DIR3 (*(volatile unsigned char *)0x2009C023)
#define FIO1DIR3_OFFSET 0x23

#define FIO1DIRL (*(volatile unsigned short *)0x2009C020)
#define FIO1DIRL_OFFSET 0x20

#define FIO1DIRU (*(volatile unsigned short *)0x2009C022)
#define FIO1DIRH FIO1DIRU
#define FIO1DIRU_OFFSET 0x22
#define FIO1DIRH_OFFSET FIO1DIRU_OFFSET

#define FIO2DIR (*(volatile unsigned long *)0x2009C040)
#define FIO2DIR_OFFSET 0x40

#define FIO2DIR0 (*(volatile unsigned char *)0x2009C040)
#define FIO2DIR0_OFFSET 0x40

#define FIO2DIR1 (*(volatile unsigned char *)0x2009C041)
#define FIO2DIR1_OFFSET 0x41

#define FIO2DIR2 (*(volatile unsigned char *)0x2009C042)
#define FIO2DIR2_OFFSET 0x42

#define FIO2DIR3 (*(volatile unsigned char *)0x2009C043)
#define FIO2DIR3_OFFSET 0x43

#define FIO2DIRL (*(volatile unsigned short *)0x2009C040)
#define FIO2DIRL_OFFSET 0x40

#define FIO2DIRU (*(volatile unsigned short *)0x2009C042)
#define FIO2DIRH FIO2DIRU
#define FIO2DIRU_OFFSET 0x42
#define FIO2DIRH_OFFSET FIO2DIRU_OFFSET

#define FIO3DIR (*(volatile unsigned long *)0x2009C060)
#define FIO3DIR_OFFSET 0x60

#define FIO3DIR0 (*(volatile unsigned char *)0x2009C060)
#define FIO3DIR0_OFFSET 0x60

#define FIO3DIR1 (*(volatile unsigned char *)0x2009C061)
#define FIO3DIR1_OFFSET 0x61

#define FIO3DIR2 (*(volatile unsigned char *)0x2009C062)
#define FIO3DIR2_OFFSET 0x62

#define FIO3DIR3 (*(volatile unsigned char *)0x2009C063)
#define FIO3DIR3_OFFSET 0x63

#define FIO3DIRL (*(volatile unsigned short *)0x2009C060)
#define FIO3DIRL_OFFSET 0x60

#define FIO3DIRU (*(volatile unsigned short *)0x2009C062)
#define FIO3DIRH FIO3DIRU
#define FIO3DIRU_OFFSET 0x62
#define FIO3DIRH_OFFSET FIO3DIRU_OFFSET

#define FIO4DIR (*(volatile unsigned long *)0x2009C080)
#define FIO4DIR_OFFSET 0x80

#define FIO4DIR0 (*(volatile unsigned char *)0x2009C080)
#define FIO4DIR0_OFFSET 0x80

#define FIO4DIR1 (*(volatile unsigned char *)0x2009C081)
#define FIO4DIR1_OFFSET 0x81

#define FIO4DIR2 (*(volatile unsigned char *)0x2009C082)
#define FIO4DIR2_OFFSET 0x82

#define FIO4DIR3 (*(volatile unsigned char *)0x2009C083)
#define FIO4DIR3_OFFSET 0x83

#define FIO4DIRL (*(volatile unsigned short *)0x2009C080)
#define FIO4DIRL_OFFSET 0x80

#define FIO4DIRU (*(volatile unsigned short *)0x2009C082)
#define FIO4DIRH FIO4DIRU
#define FIO4DIRU_OFFSET 0x82
#define FIO4DIRH_OFFSET FIO4DIRU_OFFSET

#define FIO0MASK (*(volatile unsigned long *)0x2009C010)
#define FIO0MASK_OFFSET 0x10

#define FIO0MASK0 (*(volatile unsigned char *)0x2009C010)
#define FIO0MASK0_OFFSET 0x10

#define FIO0MASK1 (*(volatile unsigned char *)0x2009C011)
#define FIO0MASK1_OFFSET 0x11

#define FIO0MASK2 (*(volatile unsigned char *)0x2009C012)
#define FIO0MASK2_OFFSET 0x12

#define FIO0MASK3 (*(volatile unsigned char *)0x2009C013)
#define FIO0MASK3_OFFSET 0x13

#define FIO0MASKL (*(volatile unsigned short *)0x2009C010)
#define FIO0MASKL_OFFSET 0x10

#define FIO0MASKU (*(volatile unsigned short *)0x2009C012)
#define FIO0MASKH FIO0MASKU
#define FIO0MASKU_OFFSET 0x12
#define FIO0MASKH_OFFSET FIO0MASKU_OFFSET

#define FIO1MASK (*(volatile unsigned long *)0x2009C030)
#define FIO1MASK_OFFSET 0x30

#define FIO1MASK0 (*(volatile unsigned char *)0x2009C030)
#define FIO1MASK0_OFFSET 0x30

#define FIO1MASK1 (*(volatile unsigned char *)0x2009C031)
#define FIO1MASK1_OFFSET 0x31

#define FIO1MASK2 (*(volatile unsigned char *)0x2009C032)
#define FIO1MASK2_OFFSET 0x32

#define FIO1MASK3 (*(volatile unsigned char *)0x2009C033)
#define FIO1MASK3_OFFSET 0x33

#define FIO1MASKL (*(volatile unsigned short *)0x2009C030)
#define FIO1MASKL_OFFSET 0x30

#define FIO1MASKU (*(volatile unsigned short *)0x2009C032)
#define FIO1MASKH FIO1MASKU
#define FIO1MASKU_OFFSET 0x32
#define FIO1MASKH_OFFSET FIO1MASKU_OFFSET

#define FIO2MASK (*(volatile unsigned long *)0x2009C050)
#define FIO2MASK_OFFSET 0x50

#define FIO2MASK0 (*(volatile unsigned char *)0x2009C050)
#define FIO2MASK0_OFFSET 0x50

#define FIO2MASK1 (*(volatile unsigned char *)0x2009C051)
#define FIO2MASK1_OFFSET 0x51

#define FIO2MASK2 (*(volatile unsigned char *)0x2009C052)
#define FIO2MASK2_OFFSET 0x52

#define FIO2MASK3 (*(volatile unsigned char *)0x2009C053)
#define FIO2MASK3_OFFSET 0x53

#define FIO2MASKL (*(volatile unsigned short *)0x2009C050)
#define FIO2MASKL_OFFSET 0x50

#define FIO2MASKU (*(volatile unsigned short *)0x2009C052)
#define FIO2MASKH FIO2MASKU
#define FIO2MASKU_OFFSET 0x52
#define FIO2MASKH_OFFSET FIO2MASKU_OFFSET

#define FIO3MASK (*(volatile unsigned long *)0x2009C070)
#define FIO3MASK_OFFSET 0x70

