FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1765.h
#define C2TFI3 (*(volatile unsigned long *)0x40048050)
#define CAN2TFI3 C2TFI3
#define C2TFI3_OFFSET 0x50
#define CAN2TFI3_OFFSET C2TFI3_OFFSET
#define C2TFI3_PRIO_MASK 0xFF
#define CAN2TFI3_PRIO_MASK C2TFI3_PRIO_MASK
#define C2TFI3_PRIO_BIT 0
#define CAN2TFI3_PRIO_BIT C2TFI3_PRIO_BIT
#define C2TFI3_DLC_MASK 0xF0000
#define CAN2TFI3_DLC_MASK C2TFI3_DLC_MASK
#define C2TFI3_DLC_BIT 16
#define CAN2TFI3_DLC_BIT C2TFI3_DLC_BIT
#define C2TFI3_RTR_MASK 0x40000000
#define CAN2TFI3_RTR_MASK C2TFI3_RTR_MASK
#define C2TFI3_RTR 0x40000000
#define CAN2TFI3_RTR C2TFI3_RTR
#define C2TFI3_RTR_BIT 30
#define CAN2TFI3_RTR_BIT C2TFI3_RTR_BIT
#define C2TFI3_FF_MASK 0x80000000
#define CAN2TFI3_FF_MASK C2TFI3_FF_MASK
#define C2TFI3_FF 0x80000000
#define CAN2TFI3_FF C2TFI3_FF
#define C2TFI3_FF_BIT 31
#define CAN2TFI3_FF_BIT C2TFI3_FF_BIT

#define C2TID3 (*(volatile unsigned long *)0x40048054)
#define CAN2TID3 C2TID3
#define C2TID3_OFFSET 0x54
#define CAN2TID3_OFFSET C2TID3_OFFSET
#define C2TID3_ID_MASK 0x7FF
#define CAN2TID3_ID_MASK C2TID3_ID_MASK
#define C2TID3_ID_BIT 0
#define CAN2TID3_ID_BIT C2TID3_ID_BIT

#define C2TDA3 (*(volatile unsigned long *)0x40048058)
#define CAN2TDA3 C2TDA3
#define C2TDA3_OFFSET 0x58
#define CAN2TDA3_OFFSET C2TDA3_OFFSET
#define C2TDA3_Data_1_MASK 0xFF
#define CAN2TDA3_Data_1_MASK C2TDA3_Data_1_MASK
#define C2TDA3_Data_1_BIT 0
#define CAN2TDA3_Data_1_BIT C2TDA3_Data_1_BIT
#define C2TDA3_Data_2_MASK 0xFF00
#define CAN2TDA3_Data_2_MASK C2TDA3_Data_2_MASK
#define C2TDA3_Data_2_BIT 8
#define CAN2TDA3_Data_2_BIT C2TDA3_Data_2_BIT
#define C2TDA3_Data_3_MASK 0xFF0000
#define CAN2TDA3_Data_3_MASK C2TDA3_Data_3_MASK
#define C2TDA3_Data_3_BIT 16
#define CAN2TDA3_Data_3_BIT C2TDA3_Data_3_BIT
#define C2TDA3_Data_4_MASK 0xFF000000
#define CAN2TDA3_Data_4_MASK C2TDA3_Data_4_MASK
#define C2TDA3_Data_4_BIT 24
#define CAN2TDA3_Data_4_BIT C2TDA3_Data_4_BIT

#define C2TDB3 (*(volatile unsigned long *)0x4004805C)
#define CAN2TDB3 C2TDB3
#define C2TDB3_OFFSET 0x5C
#define CAN2TDB3_OFFSET C2TDB3_OFFSET
#define C2TDB3_Data_5_MASK 0xFF
#define CAN2TDB3_Data_5_MASK C2TDB3_Data_5_MASK
#define C2TDB3_Data_5_BIT 0
#define CAN2TDB3_Data_5_BIT C2TDB3_Data_5_BIT
#define C2TDB3_Data_6_MASK 0xFF00
#define CAN2TDB3_Data_6_MASK C2TDB3_Data_6_MASK
#define C2TDB3_Data_6_BIT 8
#define CAN2TDB3_Data_6_BIT C2TDB3_Data_6_BIT
#define C2TDB3_Data_7_MASK 0xFF0000
#define CAN2TDB3_Data_7_MASK C2TDB3_Data_7_MASK
#define C2TDB3_Data_7_BIT 16
#define CAN2TDB3_Data_7_BIT C2TDB3_Data_7_BIT
#define C2TDB3_Data_8_MASK 0xFF000000
#define CAN2TDB3_Data_8_MASK C2TDB3_Data_8_MASK
#define C2TDB3_Data_8_BIT 24
#define CAN2TDB3_Data_8_BIT C2TDB3_Data_8_BIT

#define I2C1_BASE_ADDRESS 0x4005C000

#define I2C1CONSET (*(volatile unsigned char *)0x4005C000)
#define I2C1CONSET_OFFSET 0x0
#define I2C1CONSET_AA_MASK 0x4
#define I2C1CONSET_AA 0x4
#define I2C1CONSET_AA_BIT 2
#define I2C1CONSET_SI_MASK 0x8
#define I2C1CONSET_SI 0x8
#define I2C1CONSET_SI_BIT 3
#define I2C1CONSET_STO_MASK 0x10
#define I2C1CONSET_STO 0x10
#define I2C1CONSET_STO_BIT 4
#define I2C1CONSET_STA_MASK 0x20
#define I2C1CONSET_STA 0x20
#define I2C1CONSET_STA_BIT 5
#define I2C1CONSET_I2EN_MASK 0x40
#define I2C1CONSET_I2EN 0x40
#define I2C1CONSET_I2EN_BIT 6

#define I2C1STAT (*(volatile unsigned char *)0x4005C004)
#define I2C1STAT_OFFSET 0x4
#define I2C1STAT_Status_MASK 0xF8
#define I2C1STAT_Status_BIT 3

#define I2C1DAT (*(volatile unsigned char *)0x4005C008)
#define I2C1DAT_OFFSET 0x8

#define I2C1ADR0 (*(volatile unsigned char *)0x4005C00C)
#define I2C1ADR0_OFFSET 0xC
#define I2C1ADR0_GC_MASK 0x1
#define I2C1ADR0_GC 0x1
#define I2C1ADR0_GC_BIT 0
#define I2C1ADR0_Address_MASK 0xFE
#define I2C1ADR0_Address_BIT 1

#define I2C1SCLH (*(volatile unsigned short *)0x4005C010)
#define I2C1SCLH_OFFSET 0x10

#define I2C1SCLL (*(volatile unsigned short *)0x4005C014)
#define I2C1SCLL_OFFSET 0x14

#define I2C1CONCLR (*(volatile unsigned char *)0x4005C018)
#define I2C1CONCLR_OFFSET 0x18
#define I2C1CONCLR_AAC_MASK 0x4
#define I2C1CONCLR_AAC 0x4
#define I2C1CONCLR_AAC_BIT 2
#define I2C1CONCLR_SIC_MASK 0x8
#define I2C1CONCLR_SIC 0x8
#define I2C1CONCLR_SIC_BIT 3
#define I2C1CONCLR_STAC_MASK 0x20
#define I2C1CONCLR_STAC 0x20
#define I2C1CONCLR_STAC_BIT 5
#define I2C1CONCLR_I2ENC_MASK 0x40
#define I2C1CONCLR_I2ENC 0x40
#define I2C1CONCLR_I2ENC_BIT 6

#define I2C1MMCTRL (*(volatile unsigned char *)0x4005C01C)
#define I2C1MMCTRL_OFFSET 0x1C
#define I2C1MMCTRL_MM_ENA_MASK 0x1
#define I2C1MMCTRL_MM_ENA 0x1
#define I2C1MMCTRL_MM_ENA_BIT 0
#define I2C1MMCTRL_ENA_SCL_MASK 0x2
#define I2C1MMCTRL_ENA_SCL 0x2
#define I2C1MMCTRL_ENA_SCL_BIT 1
#define I2C1MMCTRL_MATCH_ALL_MASK 0x8
#define I2C1MMCTRL_MATCH_ALL 0x8
#define I2C1MMCTRL_MATCH_ALL_BIT 3

#define I2C1ADR1 (*(volatile unsigned char *)0x4005C020)
#define I2C1ADR1_OFFSET 0x20
#define I2C1ADR1_GC_MASK 0x1
#define I2C1ADR1_GC 0x1
#define I2C1ADR1_GC_BIT 0
#define I2C1ADR1_Address_MASK 0xFE
#define I2C1ADR1_Address_BIT 1

#define I2C1ADR2 (*(volatile unsigned char *)0x4005C024)
#define I2C1ADR2_OFFSET 0x24
#define I2C1ADR2_GC_MASK 0x1
#define I2C1ADR2_GC 0x1
#define I2C1ADR2_GC_BIT 0
#define I2C1ADR2_Address_MASK 0xFE
#define I2C1ADR2_Address_BIT 1

#define I2C1ADR3 (*(volatile unsigned char *)0x4005C028)
#define I2C1ADR3_OFFSET 0x28
#define I2C1ADR3_GC_MASK 0x1
#define I2C1ADR3_GC 0x1
#define I2C1ADR3_GC_BIT 0
#define I2C1ADR3_Address_MASK 0xFE
#define I2C1ADR3_Address_BIT 1

#define I2C1DATA_BUFFER (*(volatile unsigned char *)0x4005C02C)
#define I2C1DATA_BUFFER_OFFSET 0x2C

#define I2C1MASK0 (*(volatile unsigned long *)0x4005C030)
#define I2C1MASK0_OFFSET 0x30
#define I2C1MASK0_MASK_MASK 0xFE
#define I2C1MASK0_MASK_BIT 1

#define I2C1MASK1 (*(volatile unsigned long *)0x4005C034)
#define I2C1MASK1_OFFSET 0x34
#define I2C1MASK1_MASK_MASK 0xFE
#define I2C1MASK1_MASK_BIT 1

#define I2C1MASK2 (*(volatile unsigned long *)0x4005C038)
#define I2C1MASK2_OFFSET 0x38
#define I2C1MASK2_MASK_MASK 0xFE
#define I2C1MASK2_MASK_BIT 1

#define I2C1MASK3 (*(volatile unsigned long *)0x4005C03C)
#define I2C1MASK3_OFFSET 0x3C
#define I2C1MASK3_MASK_MASK 0xFE
#define I2C1MASK3_MASK_BIT 1

#define SSP0_BASE_ADDRESS 0x40088000

#define SSP0CR0 (*(volatile unsigned long *)0x40088000)
#define SSP0CR0_OFFSET 0x0
#define SSP0CR0_SCR_MASK 0xFF00
#define SSP0CR0_SCR_BIT 8
#define SSP0CR0_CPHA_MASK 0x80
#define SSP0CR0_CPHA 0x80
#define SSP0CR0_CPHA_BIT 7
#define SSP0CR0_CPOL_MASK 0x40
#define SSP0CR0_CPOL 0x40
#define SSP0CR0_CPOL_BIT 6
#define SSP0CR0_FRF_MASK 0x30
#define SSP0CR0_FRF_BIT 4
#define SSP0CR0_DSS_MASK 0xF
#define SSP0CR0_DSS_BIT 0

