FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1765.h
#define NVIC_ICPR0 (*(volatile unsigned *)0xE000E280)
#define Irq_0_to_31_Clear_Pending NVIC_ICPR0
#define NVIC_ICPR0_OFFSET 0x180
#define Irq_0_to_31_Clear_Pending_OFFSET NVIC_ICPR0_OFFSET

#define NVIC_ICPR1 (*(volatile unsigned *)0xE000E284)
#define Irq_32_to_63_Clear_Pending NVIC_ICPR1
#define NVIC_ICPR1_OFFSET 0x184
#define Irq_32_to_63_Clear_Pending_OFFSET NVIC_ICPR1_OFFSET

#define NVIC_ICPR2 (*(volatile unsigned *)0xE000E288)
#define Irq_64_to_95_Clear_Pending NVIC_ICPR2
#define NVIC_ICPR2_OFFSET 0x188
#define Irq_64_to_95_Clear_Pending_OFFSET NVIC_ICPR2_OFFSET

#define NVIC_ICPR3 (*(volatile unsigned *)0xE000E28C)
#define Irq_96_to_127_Clear_Pending NVIC_ICPR3
#define NVIC_ICPR3_OFFSET 0x18C
#define Irq_96_to_127_Clear_Pending_OFFSET NVIC_ICPR3_OFFSET

#define NVIC_IABR0 (*(volatile unsigned *)0xE000E300)
#define Irq_0_to_31_Active_Bit NVIC_IABR0
#define NVIC_IABR0_OFFSET 0x200
#define Irq_0_to_31_Active_Bit_OFFSET NVIC_IABR0_OFFSET

#define NVIC_IABR1 (*(volatile unsigned *)0xE000E304)
#define Irq_32_to_63_Active_Bit NVIC_IABR1
#define NVIC_IABR1_OFFSET 0x204
#define Irq_32_to_63_Active_Bit_OFFSET NVIC_IABR1_OFFSET

#define NVIC_IABR2 (*(volatile unsigned *)0xE000E308)
#define Irq_64_to_95_Active_Bit NVIC_IABR2
#define NVIC_IABR2_OFFSET 0x208
#define Irq_64_to_95_Active_Bit_OFFSET NVIC_IABR2_OFFSET

#define NVIC_IABR3 (*(volatile unsigned *)0xE000E30C)
#define Irq_96_to_127_Active_Bit NVIC_IABR3
#define NVIC_IABR3_OFFSET 0x20C
#define Irq_96_to_127_Active_Bit_OFFSET NVIC_IABR3_OFFSET

#define NVIC_IPR0 (*(volatile unsigned *)0xE000E400)
#define Irq_0_to_3_Priority NVIC_IPR0
#define NVIC_IPR0_OFFSET 0x300
#define Irq_0_to_3_Priority_OFFSET NVIC_IPR0_OFFSET
#define NVIC_IPR0_PRI_0_MASK 0xFF
#define Irq_0_to_3_Priority_PRI_0_MASK NVIC_IPR0_PRI_0_MASK
#define NVIC_IPR0_PRI_0_BIT 0
#define Irq_0_to_3_Priority_PRI_0_BIT NVIC_IPR0_PRI_0_BIT
#define NVIC_IPR0_PRI_1_MASK 0xFF00
#define Irq_0_to_3_Priority_PRI_1_MASK NVIC_IPR0_PRI_1_MASK
#define NVIC_IPR0_PRI_1_BIT 8
#define Irq_0_to_3_Priority_PRI_1_BIT NVIC_IPR0_PRI_1_BIT
#define NVIC_IPR0_PRI_2_MASK 0xFF0000
#define Irq_0_to_3_Priority_PRI_2_MASK NVIC_IPR0_PRI_2_MASK
#define NVIC_IPR0_PRI_2_BIT 16
#define Irq_0_to_3_Priority_PRI_2_BIT NVIC_IPR0_PRI_2_BIT
#define NVIC_IPR0_PRI_3_MASK 0xFF000000
#define Irq_0_to_3_Priority_PRI_3_MASK NVIC_IPR0_PRI_3_MASK
#define NVIC_IPR0_PRI_3_BIT 24
#define Irq_0_to_3_Priority_PRI_3_BIT NVIC_IPR0_PRI_3_BIT

#define NVIC_IPR1 (*(volatile unsigned *)0xE000E404)
#define Irq_4_to_7_Priority NVIC_IPR1
#define NVIC_IPR1_OFFSET 0x304
#define Irq_4_to_7_Priority_OFFSET NVIC_IPR1_OFFSET
#define NVIC_IPR1_PRI_4_MASK 0xFF
#define Irq_4_to_7_Priority_PRI_4_MASK NVIC_IPR1_PRI_4_MASK
#define NVIC_IPR1_PRI_4_BIT 0
#define Irq_4_to_7_Priority_PRI_4_BIT NVIC_IPR1_PRI_4_BIT
#define NVIC_IPR1_PRI_5_MASK 0xFF00
#define Irq_4_to_7_Priority_PRI_5_MASK NVIC_IPR1_PRI_5_MASK
#define NVIC_IPR1_PRI_5_BIT 8
#define Irq_4_to_7_Priority_PRI_5_BIT NVIC_IPR1_PRI_5_BIT
#define NVIC_IPR1_PRI_6_MASK 0xFF0000
#define Irq_4_to_7_Priority_PRI_6_MASK NVIC_IPR1_PRI_6_MASK
#define NVIC_IPR1_PRI_6_BIT 16
#define Irq_4_to_7_Priority_PRI_6_BIT NVIC_IPR1_PRI_6_BIT
#define NVIC_IPR1_PRI_7_MASK 0xFF000000
#define Irq_4_to_7_Priority_PRI_7_MASK NVIC_IPR1_PRI_7_MASK
#define NVIC_IPR1_PRI_7_BIT 24
#define Irq_4_to_7_Priority_PRI_7_BIT NVIC_IPR1_PRI_7_BIT

#define NVIC_IPR2 (*(volatile unsigned *)0xE000E408)
#define Irq_8_to_11_Priority NVIC_IPR2
#define NVIC_IPR2_OFFSET 0x308
#define Irq_8_to_11_Priority_OFFSET NVIC_IPR2_OFFSET
#define NVIC_IPR2_PRI_8_MASK 0xFF
#define Irq_8_to_11_Priority_PRI_8_MASK NVIC_IPR2_PRI_8_MASK
#define NVIC_IPR2_PRI_8_BIT 0
#define Irq_8_to_11_Priority_PRI_8_BIT NVIC_IPR2_PRI_8_BIT
#define NVIC_IPR2_PRI_9_MASK 0xFF00
#define Irq_8_to_11_Priority_PRI_9_MASK NVIC_IPR2_PRI_9_MASK
#define NVIC_IPR2_PRI_9_BIT 8
#define Irq_8_to_11_Priority_PRI_9_BIT NVIC_IPR2_PRI_9_BIT
#define NVIC_IPR2_PRI_10_MASK 0xFF0000
#define Irq_8_to_11_Priority_PRI_10_MASK NVIC_IPR2_PRI_10_MASK
#define NVIC_IPR2_PRI_10_BIT 16
#define Irq_8_to_11_Priority_PRI_10_BIT NVIC_IPR2_PRI_10_BIT
#define NVIC_IPR2_PRI_11_MASK 0xFF000000
#define Irq_8_to_11_Priority_PRI_11_MASK NVIC_IPR2_PRI_11_MASK
#define NVIC_IPR2_PRI_11_BIT 24
#define Irq_8_to_11_Priority_PRI_11_BIT NVIC_IPR2_PRI_11_BIT

#define NVIC_IPR3 (*(volatile unsigned *)0xE000E40C)
#define Irq_12_to_15_Priority NVIC_IPR3
#define NVIC_IPR3_OFFSET 0x30C
#define Irq_12_to_15_Priority_OFFSET NVIC_IPR3_OFFSET
#define NVIC_IPR3_PRI_12_MASK 0xFF
#define Irq_12_to_15_Priority_PRI_12_MASK NVIC_IPR3_PRI_12_MASK
#define NVIC_IPR3_PRI_12_BIT 0
#define Irq_12_to_15_Priority_PRI_12_BIT NVIC_IPR3_PRI_12_BIT
#define NVIC_IPR3_PRI_13_MASK 0xFF00
#define Irq_12_to_15_Priority_PRI_13_MASK NVIC_IPR3_PRI_13_MASK
#define NVIC_IPR3_PRI_13_BIT 8
#define Irq_12_to_15_Priority_PRI_13_BIT NVIC_IPR3_PRI_13_BIT
#define NVIC_IPR3_PRI_14_MASK 0xFF0000
#define Irq_12_to_15_Priority_PRI_14_MASK NVIC_IPR3_PRI_14_MASK
#define NVIC_IPR3_PRI_14_BIT 16
#define Irq_12_to_15_Priority_PRI_14_BIT NVIC_IPR3_PRI_14_BIT
#define NVIC_IPR3_PRI_15_MASK 0xFF000000
#define Irq_12_to_15_Priority_PRI_15_MASK NVIC_IPR3_PRI_15_MASK
#define NVIC_IPR3_PRI_15_BIT 24
#define Irq_12_to_15_Priority_PRI_15_BIT NVIC_IPR3_PRI_15_BIT

#define NVIC_IPR4 (*(volatile unsigned *)0xE000E410)
#define Irq_16_to_19_Priority NVIC_IPR4
#define NVIC_IPR4_OFFSET 0x310
#define Irq_16_to_19_Priority_OFFSET NVIC_IPR4_OFFSET
#define NVIC_IPR4_PRI_16_MASK 0xFF
#define Irq_16_to_19_Priority_PRI_16_MASK NVIC_IPR4_PRI_16_MASK
#define NVIC_IPR4_PRI_16_BIT 0
#define Irq_16_to_19_Priority_PRI_16_BIT NVIC_IPR4_PRI_16_BIT
#define NVIC_IPR4_PRI_17_MASK 0xFF00
#define Irq_16_to_19_Priority_PRI_17_MASK NVIC_IPR4_PRI_17_MASK
#define NVIC_IPR4_PRI_17_BIT 8
#define Irq_16_to_19_Priority_PRI_17_BIT NVIC_IPR4_PRI_17_BIT
#define NVIC_IPR4_PRI_18_MASK 0xFF0000
#define Irq_16_to_19_Priority_PRI_18_MASK NVIC_IPR4_PRI_18_MASK
#define NVIC_IPR4_PRI_18_BIT 16
#define Irq_16_to_19_Priority_PRI_18_BIT NVIC_IPR4_PRI_18_BIT
#define NVIC_IPR4_PRI_19_MASK 0xFF000000
#define Irq_16_to_19_Priority_PRI_19_MASK NVIC_IPR4_PRI_19_MASK
#define NVIC_IPR4_PRI_19_BIT 24
#define Irq_16_to_19_Priority_PRI_19_BIT NVIC_IPR4_PRI_19_BIT

#define NVIC_IPR5 (*(volatile unsigned *)0xE000E414)
#define Irq_20_to_23_Priority NVIC_IPR5
#define NVIC_IPR5_OFFSET 0x314
#define Irq_20_to_23_Priority_OFFSET NVIC_IPR5_OFFSET
#define NVIC_IPR5_PRI_20_MASK 0xFF
#define Irq_20_to_23_Priority_PRI_20_MASK NVIC_IPR5_PRI_20_MASK
#define NVIC_IPR5_PRI_20_BIT 0
#define Irq_20_to_23_Priority_PRI_20_BIT NVIC_IPR5_PRI_20_BIT
#define NVIC_IPR5_PRI_21_MASK 0xFF00
#define Irq_20_to_23_Priority_PRI_21_MASK NVIC_IPR5_PRI_21_MASK
#define NVIC_IPR5_PRI_21_BIT 8
#define Irq_20_to_23_Priority_PRI_21_BIT NVIC_IPR5_PRI_21_BIT
#define NVIC_IPR5_PRI_22_MASK 0xFF0000
#define Irq_20_to_23_Priority_PRI_22_MASK NVIC_IPR5_PRI_22_MASK
#define NVIC_IPR5_PRI_22_BIT 16
#define Irq_20_to_23_Priority_PRI_22_BIT NVIC_IPR5_PRI_22_BIT
#define NVIC_IPR5_PRI_23_MASK 0xFF000000
#define Irq_20_to_23_Priority_PRI_23_MASK NVIC_IPR5_PRI_23_MASK
#define NVIC_IPR5_PRI_23_BIT 24
#define Irq_20_to_23_Priority_PRI_23_BIT NVIC_IPR5_PRI_23_BIT

